/*--------------------------------------------------------------------------
SmokeDetector

烟雾自动监测报警及空气净化综合系统源代码

IO口使用情况：
	P1.0-P1.4：四路语音提示器接口（1.01版本增加）
	P0.4-P0.7：四路PWM波形输出，由3到0排列
	P1.0-P1.4：显示器接口
	P2：键盘口
	P3.0,P3.1：I2C接口，SCLK,SDI
中断使用情况：
	INT0:键盘中断
	定时器0中断，模式2，中断频率4kHz
	定时器1中断，模式1，中断频率20Hz（1.01版本增加）
晶振频率：12MHz
--------------------------------------------------------------------------*/
#include"UI.h"

void main()
{	
    /*相关初始化*/
	LcdInit();
	KeyBoardInit();
	PWMInit();
	SmokeDetectorInit();
	UiInit();

	UiMain();//转入人机界面模块，系统交由UI控制
}